export const useServices = () => {
  const services = [
    {
      id: 1,
      title: "ركن الرسم والفنون",
      desc: "مساحة إبداعية تطوّر خيال الطفل وتعزز التعبير الفني بالألوان.",
      image: "/arts-corner.webp",
      color: "color-1",
    },
    {
      id: 2,
      title: "ركن المطبخ والطبخ",
      desc: "تجربة تعليمية ممتعة تعزز الاعتماد على النفس والعمل الجماعي.",
      image: "/cooking-corner.webp",
      color: "color-2",
    },
    {
      id: 3,
      title: "ركن مسرح الطفل",
      desc: "مساحة تفاعلية تنمّي الثقة والتعبير والإبداع من خلال اللعب والتمثيل.",
      image: "/corner-theater.webp",
      color: "color-3",
    },
    {
      id: 4,
      title: "ركن تعلم اللغات",
      desc: "بيئة تعليمية ممتعة تساعد الطفل على اكتساب اللغات وبناء مهارات التواصل.",
      image: "/learning-corner.webp",
      color: "color-4",
    },
    {
      id: 5,
      title: "النادي الرياضي للأطفال",
      desc: "أنشطة حركية تساعد على تقوية الجسم وبناء عادات صحية.",
      image: "/ports-club.webp",
      color: "color-5",
    },
    {
      id: 6,
      title: "ركن المهارات الفكرية",
      desc: "أنشطة ذكية لتنمية التفكير، التركيز، وحل المشكلات بأسلوب ممتع.",
      image: "/skills-corner.webp",
      color: "color-6",
    }
  ]

  const articles = [
    {
      img:"/blog-1.webp",
      date: "2025-12-15",
      author: "فريق كيان",
      title: "نشاطات للأطفال 3 سنوات: دليل كيان لدعم ونمو طفلك بشكل سليم!",
      excerpt: "ففي هذه الفترة يبدأ في استكشاف العالم بشكل أوسع، ويزداد فضوله، وتتطور قدراته الحركية والعقلية والاجتماعية بشكل سريع. ولذلك فإن اختيار نشاطات للأطفال 3 سنوات",

    },
    {
      img:"/blog-2.webp",
      date: "2025-12-10",
      author: "فريق كيان",
      title: "كيف تصنع الأنشطة الفنية فرقًا في نمو طفلك؟",
      excerpt: "هل لاحظت يومًا كيف تؤثر الأنشطة الفنية بمختلف أنواعها على طفلك، سواء كانت (الرسم، الموسيقى، المسرح) وغيرها؟",

    },
    {
      img:"/blog-3.webp",
      date: "2025-12-05",
      author: "فريق كيان",
      title: "الأمان والرعاية في حضانة فيوتشر كيان - مكان آمن لطفلك",
      excerpt: "إن أكثر ما يبحث عنه الآباء عند اختيار أفضل دور حضانة لأطفالهم أن تكون تتصف بالأمن والرعاية المتكاملة للأطفال، بجانب البحث عن كيفية تنمية مهارات الطفل، حيث أن الأمن",

    },
    {
      img:"/blog-4.webp",
      date: "2025-12-01",
      author: "فريق كيان",
      title: "تطوير المهارات الاجتماعية عند الأطفال في فيوتشر كيان أفضل حضانة أطفال بالرياض.",
      excerpt: "تتعدد مزايا تنمية مهارات للاطفال وخاصة المهارات الإجتماعية، لذلك يسعى الآباء إلى إلتحاق أطفالهم منذ الصغر إلى دور الحضانة حيث أن الحضانة قادرة على تنمية القدرات",
    }
  ];

  return { services, articles }
}
